In [2]:
import pandas as pd
import numpy as np

#### Series

In [2]:
a = np.array([1001,1002,1003,1004])

In [6]:
series = pd.Series(a)

In [7]:
series[0]

1001

In [8]:
series[1:]

1    1002
2    1003
3    1004
dtype: int32

In [9]:
series[0]=10001

In [11]:
series[4]=1005

In [13]:
series[6]=1006

In [14]:
series

0    10001
1     1002
2     1003
3     1004
4     1005
6     1006
dtype: int64

In [29]:
data = {'a':1001,'b':1002,'c':1003,'d':'sagar'}
data

{'a': 1001, 'b': 1002, 'c': 1003, 'd': 'sagar'}

In [22]:
data_der = pd.Series(data)
data_der

a     1001
b     1002
c     1003
d    sagar
dtype: object

In [20]:
data_der['a'] #accesing element using key

1001

In [23]:
data_der[0]

1001

In [28]:
data_der[-2:]

c     1003
d    sagar
dtype: object

#### Dataframes

In [31]:
data = [['S',34],['A',43],['g',23],['A',56],['r',78]]

In [32]:
df = pd.DataFrame(data)

In [33]:
type(df)

pandas.core.frame.DataFrame

In [34]:
df

   0   1
0  S  34
1  A  43
2  g  23
3  A  56
4  r  78

In [37]:
df.columns=['Name','Age']
df

  Name  Age
0    S   34
1    A   43
2    g   23
3    A   56
4    r   78

In [46]:
#Indexed data from dictionary
data = {'Name':['A','B','C'],'Age':[18,20,25]}
df = pd.DataFrame(data,index=['r1','r2','r3'])
#df = pd.DataFrame(data,index=[1,2,3])
#df = pd.DataFrame(data,index=df['Name'])
df

   Name  Age
r1    A   18
r2    B   20
r3    C   25

In [47]:
df['Name']

r1    A
r2    B
r3    C
Name: Name, dtype: object

In [50]:
df[['Name','Age']] #Column names are case sensitive

   Name  Age
r1    A   18
r2    B   20
r3    C   25

In [53]:
df['Location']=['Mumbai','Pune','Banglore'] # Adding a location column

In [62]:
df.loc['r1':'r3',['Name','Age','Location']] # loc - row labels

   Name  Age  Location
r1    A   18    Mumbai
r2    B   20      Pune
r3    C   25  Banglore

In [77]:
df.iloc[0:3,1:2] #iloc <- index location

    Age
r1   18
r2   20
r3   25

In [78]:
df = df[['Name','Age','Location']]

In [79]:
df

   Name  Age  Location
r1    A   18    Mumbai
r2    B   20      Pune
r3    C   25  Banglore

In [81]:
df['Salary']=[15380,24581,56701]
df

   Name  Age  Location  Salary
r1    A   18    Mumbai   15380
r2    B   20      Pune   24581
r3    C   25  Banglore   56701

In [89]:
df['Blank Column']=np.NaN
df

   Name  Age  Location  Salary  Blank Column
r1    A   18    Mumbai   15380           NaN
r2    B   20      Pune   24581           NaN
r3    C   25  Banglore   56701           NaN

In [92]:
df['Salary New']=df['Salary'] + (0.05*df['Salary'])
df

   Name  Age  Location  Salary  Blank Column  Salary New
r1    A   18    Mumbai   15380           NaN    16149.00
r2    B   20      Pune   24581           NaN    25810.05
r3    C   25  Banglore   56701           NaN    59536.05

In [96]:
#Deleting column
df.columns
del df['Salary']

In [100]:
df = df.drop(['Blank Column'],axis=1)

KeyError: "['Blank Column'] not found in axis"

In [104]:
#Renameing a column name
df.rename(columns={'Salary New':'Salary'},inplace=True)

In [105]:
df

   Name  Age  Location    Salary
r1    A   18    Mumbai  16149.00
r2    B   20      Pune  25810.05
r3    C   25  Banglore  59536.05

In [109]:
df.loc['r1':'r2',['Name','Age']]

   Name  Age
r1    A   18
r2    B   20

In [111]:
df.iloc[:,1:4]

    Age  Location    Salary
r1   18    Mumbai  16149.00
r2   20      Pune  25810.05
r3   25  Banglore  59536.05

In [113]:
#Saving file to csv file
df.to_csv(r'C:\Users\Sagar.Koktare\Desktop\df.csv',columns=['Age','Location','Salary'],index=False)

In [116]:
#Saving file to xlsx file
df.to_excel('df.xlsx',index=False,header=True)

In [117]:
import os
os.getcwd()

'C:\\Users\\Sagar.Koktare'

In [132]:
#Reading csv data file 
df = pd.read_csv(r'C:\Users\Sagar.Koktare\Desktop\SOE\df.csv',header=0)
df

   Age  Location    Salary
0   18    Mumbai  16149.00
1   20      Pune  25810.05
2   25  Banglore  59536.05

In [131]:
df

In [128]:
?pd.read_csv

In [126]:
#reading excel data file
df2 = pd.read_excel('df.xlsx',header=0)
df2

  Name  Age  Location    Salary
0    A   18    Mumbai  16149.00
1    B   20      Pune  25810.05
2    C   25  Banglore  59536.05

In [134]:
df.dtypes #to find out which column has which data types

Age           int64
Location     object
Salary      float64
dtype: object

In [135]:
df.Age.dtype #check data type of a one variable

dtype('int64')

In [136]:
df.shape

(3, 3)

In [141]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       3 non-null      int64
 1   Location  3 non-null      object
 2   Salary    3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

In [142]:
df.describe()

             Age        Salary
count   3.000000      3.000000
mean   21.000000  33831.700000
std     3.605551  22778.700105
min    18.000000  16149.000000
25%    19.000000  20979.525000
50%    20.000000  25810.050000
75%    22.500000  42673.050000
max    25.000000  59536.050000

In [143]:
df

   Age  Location    Salary
0   18    Mumbai  16149.00
1   20      Pune  25810.05
2   25  Banglore  59536.05

In [148]:
df.at[1,['Age','Location']]=['23','Delhi'] #Changing value of observation based on index no.
df

  Age  Location    Salary
0  18    Mumbai  16149.00
1  23     Delhi  25810.05
2  25  Banglore  59536.05

In [169]:
df.loc[(df.Age==18) & (df.Location=='Mumbai'),['Salary']]=[45890]

In [182]:
df.loc[(df.Age=='23') & (df.Salary==25810.05),['Salary']]=[54890]

In [183]:
df

  Age  Location    Salary
0  18    Mumbai  45890.00
1  23     Delhi  54890.00
2  25  Banglore  59536.05

In [190]:
df.sort_values(['Location','Salary'],ascending=[False,True])

  Age  Location    Salary
0  18    Mumbai  45890.00
1  23     Delhi  54890.00
2  25  Banglore  59536.05

In [181]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       3 non-null      object
 1   Location  3 non-null      object
 2   Salary    3 non-null      float64
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

In [195]:
df.sort_index(axis=0,ascending=False)

  Age  Location    Salary
2  25  Banglore  59536.05
1  23     Delhi  54890.00
0  18    Mumbai  45890.00

### SQL Joins

In [3]:
#reading excel data file
df1 = pd.read_excel('df1.xlsx',header=0)
df2 = pd.read_excel('df2.xlsx',header=0)

In [4]:
df1.head()

   id Name  Marks
0   1    A     90
1   2    B     85
2   3    C     60
3   4    D     45
4   5    E     55

In [5]:
df2.head()

   id  Location
0   1    Mumbai
1   2  Banglore
2   5      Pune
3   6     Delhi
4   7    Gujrat

In [6]:
#by default inner join
merged = pd.merge(df1,df2,on="id")

In [7]:
merged.head()

   id Name  Marks  Location
0   1    A     90    Mumbai
1   2    B     85  Banglore
2   5    E     55      Pune

In [9]:
#left join
merged = pd.merge(df1,df2,on="id",how="left")
merged

   id Name  Marks  Location
0   1    A     90    Mumbai
1   2    B     85  Banglore
2   3    C     60       NaN
3   4    D     45       NaN
4   5    E     55      Pune

In [10]:
#right join
merged = pd.merge(df1,df2,on="id",how="right")
merged

   id Name  Marks  Location
0   1    A   90.0    Mumbai
1   2    B   85.0  Banglore
2   5    E   55.0      Pune
3   6  NaN    NaN     Delhi
4   7  NaN    NaN    Gujrat

In [12]:
#outer join
merged = pd.merge(df1,df2,on="id",how="outer")
merged

   id Name  Marks  Location
0   1    A   90.0    Mumbai
1   2    B   85.0  Banglore
2   3    C   60.0       NaN
3   4    D   45.0       NaN
4   5    E   55.0      Pune
5   6  NaN    NaN     Delhi
6   7  NaN    NaN    Gujrat

In [14]:
df1_clean = df1.applymap(lambda s:s.lower().strip() if type(s)== str else s)
df1_clean

   id Name  Marks
0   1    a     90
1   2    b     85
2   3    c     60
3   4    d     45
4   5    e     55